      01  MYSTRUCTURE.
                05 FIELD1    PIC X.
                05 FIELD2    PIC 9.
       77  NEW-FIELD         PIC X.
           COPY COPY2.
