       IDENTIFICATION DIVISION.
       PROGRAM-ID.     HELLOD.
      *blablaaaaaasssss
      *insertion 2ddddd
      *i3333ddddd
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY COPY1.
       PROCEDURE DIVISION.
           DISPLAY "Hello Dante!".                                      12345678
           INITIALIZE FIELD1 FIELD2.
           DISPLAY "A"                                                  12345678
           STOP RUN.