       IDENTIFICATION DIVISION.
       PROGRAM-ID.     HELLOD.

       PROCEDURE DIVISION.
           DISPLAY "Hello Dante!".
           STOP RUN.